In [1]:
!pip install Selenium

Requirement already satisfied: Selenium in c:\users\megha\anaconda3\lib\site-packages (4.16.0)
Requirement already satisfied: trio~=0.17 in c:\users\megha\anaconda3\lib\site-packages (from Selenium) (0.24.0)
Requirement already satisfied: trio-websocket~=0.9 in c:\users\megha\anaconda3\lib\site-packages (from Selenium) (0.11.1)
Requirement already satisfied: urllib3[socks]<3,>=1.26 in c:\users\megha\anaconda3\lib\site-packages (from Selenium) (1.26.14)
Requirement already satisfied: certifi>=2021.10.8 in c:\users\megha\anaconda3\lib\site-packages (from Selenium) (2022.12.7)
Requirement already satisfied: exceptiongroup in c:\users\megha\anaconda3\lib\site-packages (from trio~=0.17->Selenium) (1.2.0)
Requirement already satisfied: outcome in c:\users\megha\anaconda3\lib\site-packages (from trio~=0.17->Selenium) (1.3.0.post0)
Requirement already satisfied: cffi>=1.14 in c:\users\megha\anaconda3\lib\site-packages (from trio~=0.17->Selenium) (1.15.1)
Requirement already satisfied: idna in c:\users\megha\anaconda3\lib\site-packages (from trio~=0.17->Selenium) (3.4)
Requirement already satisfied: attrs>=20.1.0 in c:\users\megha\anaconda3\lib\site-packages (from trio~=0.17->Selenium) (22.1.0)
Requirement already satisfied: sortedcontainers in c:\users\megha\anaconda3\lib\site-packages (from trio~=0.17->Selenium) (2.4.0)
Requirement already satisfied: sniffio>=1.3.0 in c:\users\megha\anaconda3\lib\site-packages (from trio~=0.17->Selenium) (1.3.0)
Requirement already satisfied: wsproto>=0.14 in c:\users\megha\anaconda3\lib\site-packages (from trio-websocket~=0.9->Selenium) (1.2.0)
Requirement already satisfied: PySocks!=1.5.7,<2.0,>=1.5.6 in c:\users\megha\anaconda3\lib\site-packages (from urllib3[socks]<3,>=1.26->Selenium) (1.7.1)
Requirement already satisfied: pycparser in c:\users\megha\anaconda3\lib\site-packages (from cffi>=1.14->trio~=0.17->Selenium) (2.21)
Requirement already satisfied: h11<1,>=0.9.0 in c:\users\megha\anaconda3\lib\site-packages (from wsproto>=0.14->trio-websocket~=0.9->Selenium) (0.14.0)

In [30]:
import selenium
import pandas as pd
from selenium import webdriver
import warnings
warnings.filterwarnings('ignore')
from selenium.webdriver.common.by import By
import time

In [146]:
#Q1.Ans:-

In [31]:
driver=webdriver.Chrome()

In [32]:
driver.get("https://www.shine.com/")

In [33]:
Job_title=driver.find_element(By.ID,"id_q")
Job_title.send_keys("Data Analyst")

In [34]:
Location=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
Location.send_keys("Bangalore")

In [35]:
Search=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
Search.click()

In [77]:
Job_Title=[]
title_tag=driver.find_elements(By.XPATH,'//h2[@itemprop="name"]/a')
for i in title_tag[0:10]:
    title=i.text
    Job_Title.append(title)

In [53]:
Company_Name=[]
Company=driver.find_elements(By.CLASS_NAME,"jobCard_jobCard_cName__mYnow")
for i in Company [0:10]:
    Company=i.text
    Company_Name.append(Company)

In [89]:
Experience_Required=[]
Experience=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in Experience[0:10]:
    Experience=i.text
    Experience_Required.append(Experience)

In [98]:
Job_Location=[]
Job=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in Job[0:10]:
    Job=i.text
    Job_Location.append(Job)

In [99]:
len(Job_Location)

10

In [101]:
df=pd.DataFrame({"Job Title":Job_Title,"Company Name":Company_Name,"Experience Required":Experience_Required,"Job_Location":Job_Location})
df

,Job Title,Company Name,Experience Required,Job_Location
0,Lead Data Analyst,ara resources private limited,4 to 9 Yrs,Bangalore
1,Data Analyst,diraa hr services hiring for mncs,0 to 1 Yr,Bangalore\n+3
2,Vacancy For Data Analyst,yogita staffing solution,0 to 3 Yrs,Bangalore\n+14
3,Clinical Data Analyst,techno endura,0 to 1 Yr,Bangalore\n+6
4,Data Modeler data,boyen haddin consulting and technol...,3 to 6 Yrs,Bangalore
5,Data Modeller,boyen haddin consulting and technol...,3 to 6 Yrs,Bangalore
6,Data Modeler Bangalore,boyen haddin consulting and technol...,3 to 6 Yrs,Bangalore
7,Data Modeler,boyen haddin consulting and technol...,3 to 6 Yrs,Bangalore
8,Clinical Data Analyst,quiscon biotech,0 to 2 Yrs,Bangalore\n+4
9,Data Analyst Hiring Fresher and Experience,kavya interprises,0 to 4 Yrs,Bangalore\n+13

In [145]:
#Q2.Ans:-

In [102]:
driver=webdriver.Chrome()

In [104]:
driver.get("https://www.shine.com/")

In [105]:
Job_title=driver.find_element(By.ID,"id_q")
Job_title.send_keys("Data Scientist")

In [106]:
Location=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
Location.send_keys("Bangalore")

In [107]:
Search=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
Search.click()

In [108]:
Job_Title=[]
title_tag=driver.find_elements(By.XPATH,'//h2[@itemprop="name"]/a')
for i in title_tag[0:10]:
    title=i.text
    Job_Title.append(title)

In [112]:
Company_Name=[]
Company=driver.find_elements(By.CLASS_NAME,"jobCard_jobCard_cName__mYnow")
for i in Company [0:10]:
    Company=i.text
    Company_Name.append(Company)

In [127]:
Experience_Required=[]
Experience=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in Experience[0:10]:
    Experience=i.text
    Experience_Required.append(Experience)

In [137]:
Job_Location=[]
Job=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in Job[0:10]:
    Job=i.text
    Job_Location.append(Job)

In [141]:
len(Job_Title),len(Company_Name),len(Experience_Required),len(Job_Location)

(10, 10, 10, 10)

In [142]:
df=pd.DataFrame({"Job Title":Job_Title,"Company Name":Company_Name,"Experience Required":Experience_Required,"Job_Location":Job_Location})
df

,Job Title,Company Name,Experience Required,Job_Location
0,Data Scientist,acme services private limited,3 to 5 Yrs,Bangalore\n+4
1,Data Scientist,ltimindtree limited,6 to 8 Yrs,Bangalore
2,Lead Data Scientist/ Principal Data Scientist,fractal,5 to 9 Yrs,Bangalore\n+1
3,Senior Data Scientist,neostats,7 to 11 Yrs,Bangalore\n+1
4,Vacancy For Data Scientist Fresher and Experience,yogita staffing solution,0 to 3 Yrs,Bangalore\n+14
5,Lead Data Scientist,aereo,7 to 10 Yrs,Bangalore\n+1
6,Data Scientist,people staffing solutions,4 to 9 Yrs,Bangalore\n+7
7,Data Scientist,diraa hr services,0 to 4 Yrs,Bangalore\n+2
8,Data Scientist Urgent Vacancy,yogita staffing solution,0 to 3 Yrs,Bangalore\n+14
9,Pharma Data Scientist,quiscon biotech,0 to 1 Yr,Bangalore\n+4

In [144]:
#Q3.Ans:-

In [167]:
driver=webdriver.Chrome()

In [168]:
driver.get("https://www.shine.com/")

In [175]:
Job_title=driver.find_element(By.ID,"id_q")
Job_title.send_keys("Data Scientist")

In [176]:
Location=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input")
Location.send_keys("Delhi")

In [177]:
Salary=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul[2]/li[1]/div/input[1]")
Salary.send_keys("3-6")

In [178]:
Search=driver.find_element(By.XPATH,"/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button")
Search.click()

In [179]:
Job_Title=[]
title_tag=driver.find_elements(By.XPATH,'//h2[@itemprop="name"]/a')
for i in title_tag[0:10]:
    title=i.text
    Job_Title.append(title)

In [180]:
Job_Location=[]
Job=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in Job[0:10]:
    Job=i.text
    Job_Location.append(Job)

In [183]:
Company_Name=[]
Company=driver.find_elements(By.CLASS_NAME,"jobCard_jobCard_cName__mYnow")
for i in Company [0:10]:
    Company=i.text
    Company_Name.append(Company)

In [186]:
Experience_Required=[]
Experience=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in Experience[0:10]:
    Experience=i.text
    Experience_Required.append(Experience)

In [189]:
df=pd.DataFrame({"Job Title":Job_Title,"Company Name":Company_Name,"Experience Required":Experience_Required,"Job_Location":Job_Location})
df

,Job Title,Company Name,Experience Required,Job_Location
0,Data Scientist - Japanese language,right advisors private limited,5 to 8 Yrs,Delhi
1,Data Scientist,thescholarhat,1 to 3 Yrs,Noida\n+1
2,DataNeuron - Senior Data Scientist - NLP,dataneuron,3 to 4 Yrs,Delhi
3,Data Scientist,acme services private limited,3 to 5 Yrs,Delhi\n+4
4,Python Data Scientist,buddy4study,4 to 8 Yrs,Noida\n+1
5,Senior Data Scientist,roadzen,5 to 9 Yrs,Delhi
6,Data Scientist,adept global,3 to 7 Yrs,Delhi
7,Senior/Lead Data Scientist- Noida/Bangalore/Hy...,techneplus,3 to 8 Yrs,Noida\n+1
8,Data Scientist,scrolltab,4 to 8 Yrs,Delhi
9,Data Scientist,info edge india ltd,1 to 5 Yrs,Noida\n+1

In [ ]:
#Q4.Ans:-

In [232]:
driver=webdriver.Chrome()

In [233]:
driver.get("https://www.flipkart.com/")

In [234]:
Product=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input")
Product.send_keys("Sunglasses")

In [235]:
Search=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/button")
Search.click()

In [328]:
Brand_Name=[]
start=0
end=3
for page in range(start,end):
    Brand=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in Brand[0:100]:
        Brand=i.text
        Brand_Name.append(Brand)
    next_button=driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[1]")
    next_button.click()

In [331]:
Product_Discription=[]
start=0
end=3
for page in range(start,end):
    PRD=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]')
    for i in PRD[0:100]:
        PRD=i.text
        Product_Discription.append(PRD)
    next_button=driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[1]")
    next_button.click()

In [317]:
Price=[]
start=0
end=3
for page in range(start,end):
    PRC=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in PRC[0:100]:
        PRC=i.text
        Price.append(PRC)
    next_button=driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[1]")
    next_button.click()

In [318]:
Discount=[]

In [319]:
start=0
end=3
for page in range(start,end):
    DIS=driver.find_elements(By.XPATH,'//div[@class="_25b18c"]/div[3]')
    for i in DIS[0:100]:
        DIS=i.text
        Discount.append(DIS)
    next_button=driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[1]")
    next_button.click()

In [333]:
len(Brand_Name),len(Product_Discription), len(Price),len(Discount)

(120, 117, 120, 120)

In [334]:
df=pd.DataFrame({"Brand_Name":Brand_Name,"Price":Price,"Discount":Discount})
df

         Brand_Name   Price Discount
0           Eyenaks    ₹346  76% off
1       Eyewearlabs  ₹2,199  38% off
2              SRPM    ₹149  88% off
3         Elligator    ₹149  70% off
4           ROADWAY    ₹179  82% off
..              ...     ...      ...
115          PIRASO    ₹299  88% off
116     Eyewearlabs  ₹1,999  44% off
117  ROZZETTA CRAFT    ₹597  76% off
118       ROYAL SON    ₹551  72% off
119    Singco India    ₹249  87% off

[120 rows x 3 columns]

In [ ]:
#Q5.Ans:-

In [335]:
driver=webdriver.Chrome()

In [339]:
driver.get("https://www.flipkart.com/apple-iphone-11-black-64-gb/p/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART&q=i+phone+11+64++black&store=tyy%2F4io&srno=s_1_1&otracker=search&otracker1=search&fm=organic&iid=bc066fcd-b0cc-4013-8f62-d90202b015c6.MOBFWQ6BXGJCEYNY.SEARCH&ppt=hp&ppn=homepage&ssid=z05agw08io0000001706548609134&qH=53755a403abf0c51")

In [340]:
Search=driver.find_element(By.XPATH,'//div[@class="_3UAT2v _16PBlm"]')
Search.click()

In [356]:
Rating=[]
start=0
end=10
for page in range(start,end):
    Rate=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]')
    for i in Rate:
        Rate=i.text
        Rating.append(Rate)
    next_button=driver.find_element(By.XPATH,'//a[@class="_1LKTO3"]')
next_button.click()

In [368]:
Review_summary=[]
start=0
end=10
for page in range(start,end):
    Review=driver.find_elements(By.CLASS_NAME,"_2-N8zT")
    for i in Review:
        Review=i.text
        Review_summary.append(Review)

In [367]:
Full_review=[]
start=0
end=10
for page in range(start,end):
    Review=driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]/div')
    for i in Review:
        Review=i.text
        Full_review.append(Review)

In [371]:
df=pd.DataFrame({"Rating":Rating,"Review summary":Review_summary,"Full review":Full_review})
df

,Rating,Review summary,Full review
0,5,Just wow!,Perfect Product!!
1,5,Worth every penny,Feeling awesome after getting the delivery of ...
2,5,Best in the market!,Good Camera
3,5,Wonderful,This is amazing at all
4,5,Classy product,Camera is awesome\nBest battery backup\nA perf...
...,...,...,...
95,5,Terrific,Very very good
96,5,Terrific purchase,Value for money 😍
97,5,Perfect product!,Photos super
98,5,Perfect product!,V Good all
99,5,Fabulous!,Super🔥 and good performance 👌❤️

In [ ]:
#Q6.Ans:-

In [372]:
driver=webdriver.Chrome()

In [373]:
driver.get("https://www.flipkart.com/")

In [374]:
Product=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/div/input")
Product.send_keys("sneakers")

In [375]:
Search=driver.find_element(By.XPATH,"/html/body/div[1]/div/div[1]/div/div/div/div/div[1]/div/div[1]/div/div[1]/div[1]/header/div[1]/div[2]/form/div/button")
Search.click()

In [447]:
Brand=[]
start=0
end=3
for page in range(start,end):
    BRD=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]')
    for i in BRD[0:100]:
        BRD=i.text
        Brand.append(BRD)
next_button=driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[11]")
next_button.click()

In [470]:
Product_Description=[]
start=0
end=3
for page in range(start,end):
    PRD=driver.find_elements(By.XPATH,'//a[@class="IRpwTa"]'or'//a[@class="IRpwTa _2-ICcC"]')
    for i in PRD:
        PRD=i.text
        Product_Description.append(PRD)
next_button=driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[11]")
next_button.click()

In [471]:
len(Product_Description)

99

In [460]:
Price=[]
start=0
end=3
for page in range(start,end):
    PRC=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]')
    for i in PRC:
        PRC=i.text
        Price.append(PRC)
next_button=driver.find_element(By.XPATH,"/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[11]")
next_button.click()

In [472]:
len(Price)

120

In [463]:
df=pd.DataFrame({"Brand":Brand,"Price":Price})
df

         Brand   Price
0       BRUTON    ₹699
1         aadi    ₹699
2     URBANBOX    ₹988
3       BRUTON    ₹926
4    Deals4you  ₹2,749
..         ...     ...
115      asian    ₹624
116   Neeman's  ₹3,600
117    BIG FOX  ₹1,679
118     BRUTON    ₹549
119   Skechers    ₹499

[120 rows x 2 columns]

In [473]:
#Q7.Ans:-

In [474]:
driver=webdriver.Chrome()

In [475]:
driver.get("https://www.amazon.in/")

In [476]:
Product=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
Product.send_keys("Laptop")

In [478]:
Search=driver.find_element(By.XPATH,'//div[@class="nav-search-submit nav-sprite"]')
Search.click()

In [480]:
Search=driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[19]/span/span[9]/li/span/a/span')
Search.click()

In [484]:
Title=[]
TTL=driver.find_elements(By.XPATH,'//a[@class="a-link-normal s-underline-text s-underline-link-text s-link-style a-text-normal"]/span')
for i in TTL[0:10]:
    TTL=i.text
    Title.append(TTL)

In [502]:
Rating=[]
RTG=driver.find_elements(By.XPATH,'//div[@class="a-row a-size-small"]/span/a')
for i in RTG[0:10]:
    RTG=i.text
    Rating.append(RTG)

In [503]:
Price=[]
PRC=driver.find_elements(By.CLASS_NAME,"a-price-whole")
for i in PRC[0:10]:
    PRC=i.text
    Price.append(PRC)

In [504]:
df=pd.DataFrame({"Title":Title,"Rating":Rating,"Price":Price})
df

                                               Title Rating     Price
0  Modern 14, Intel 12th Gen. i7-1255U, 36CM FHD ...     58    54,990
1  Galaxy Book3 Core i7 13th Gen 1355U - (16 GB/5...     65    89,990
2  Modern 14, Intel 12th Gen. i7-1255U, 36CM FHD ...     58    54,990
3  IdeaPad Slim 3 Intel Core i7 12th Gen 15.6 inc...    433    62,990
4  TUF Gaming F15, 15.6"(39.62 cms) FHD 144Hz, In...    179    77,990
5  Vivobook 15, Intel Core i7-12650H 12th Gen, 15...    414    64,990
6  Travelmate Business Laptop Intel Core i7-11th ...      1    54,990
7  Victus Gaming Laptop, 12th Gen Intel Core i7-1...    139    81,990
8  Victus Gaming Laptop 13th Gen Intel Core i7-13...    681  1,10,990
9  Pavilion X360 11th Gen Intel Core i7 14" (35.6...      5    78,990

In [505]:
#Q8.Ans:-

In [506]:
driver=webdriver.Chrome()

In [507]:
driver.get("https://www.azquotes.com/")

In [508]:
Search=driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a")
Search.click()

In [513]:
Quote=[]
QT=driver.find_elements(By.XPATH,'//a[@class="title"]')
for i in QT:
    QT=i.text
    Quote.append(QT)

In [515]:
Aurthor=[]
AT=driver.find_elements(By.CLASS_NAME,"author")
for i in AT:
    AT=i.text
    Aurthor.append(AT)

In [516]:
Type_of_Quote=[]
QT=driver.find_elements(By.CLASS_NAME,"tags")
for i in QT:
    QT=i.text
    Type_of_Quote.append(QT)

In [520]:
df=pd.DataFrame({"Quote":Quote,"Aurthor":Aurthor,"Type of Quote":Type_of_Quote})
df

,Quote,Aurthor,Type of Quote
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
95,"When the going gets weird, the weird turn pro.",Hunter S. Thompson,"Music, Sports, Hunting"
96,When a train goes through a tunnel and it gets...,Corrie Ten Boom,"Trust, Encouraging, Uplifting"
97,If you think you are too small to make a diffe...,Dalai Lama,"Inspirational, Funny, Change"
98,"God doesn't require us to succeed, he only req...",Mother Teresa,"Success, God, Mother"
99,Change your thoughts and you change your world.,Norman Vincent Peale,"Inspirational, Motivational, Change"

In [521]:
#Q9.Ans:-

In [552]:
driver=webdriver.Chrome()

In [553]:
driver.get("https://www.jagranjosh.com/")

In [565]:
Search=driver.find_element(By.XPATH,"/html/body/div/header/nav/div/div/div[3]/ul/li[3]/a")
Search.click()

In [566]:
Search=driver.find_element(By.XPATH,"/html/body/div/div[7]/section[7]/div[1]/span/a")
Search.click()

In [578]:
Search=driver.find_element(By.XPATH,"/html/body/div[1]/main/div[1]/div[1]/section/div/ul/li[6]/article/h3/a")
Search.click()

In [586]:
Name=[]
NM=driver.find_elements(By.XPATH,'//div[@class="TableData"]//a')
for i in NM[0:9]:
    NM=i.text
    Name.append(NM)

In [591]:
Term_of_office=[]
TOO=driver.find_elements(By.XPATH,'//div[@class="TableData"]//div/span')
for i in TOO[0:9]:
    TOO=i.text
    Term_of_office.append(TOO)

In [592]:
df=pd.DataFrame({"Name":Name,"Term_of_office":Term_of_office})
df

                   Name                    Term_of_office
0     Jawahar Lal Nehru     15 August 1947 to 27 May 1964
1         Indira Gandhi                16 years, 286 days
2         Indira Gandhi       27 May 1964 to 9 June 1964,
3          Rajiv Gandhi                           13 days
4       Chandra Shekhar    9 June 1964 to 11 January 1966
5  Atal Bihari Vajpayee                  1 year, 216 days
6  Atal Bihari Vajpayee  24 January 1966 to 24 March 1977
7        Manmohan Singh                 11 years, 59 days
8         Narendra Modi   24 March 1977 to  28 July 1979

In [ ]:
#Q10.Ans:-

In [527]:
driver=webdriver.Chrome()

In [528]:
driver.get("https://www.motor1.com/")

In [533]:
Product=driver.find_element(By.XPATH,"/html/body/div[10]/div[2]/div/div/div[3]/div/div/div/form/input")
Product.send_keys("50 Most expensive cars in the world")

In [534]:
Search=driver.find_element(By.XPATH,"/html/body/div[10]/div[2]/div/div/div[3]/div/div/div/form/button[1]")
Search.click()

In [535]:
Search=driver.find_element(By.XPATH,"/html/body/div[10]/div[9]/div/div[1]/div/div/div[1]/div/div[1]/h3/a")
Search.click()

In [548]:
Car_Name=[]
CN=driver.find_elements(By.XPATH,'//div[@class="postBody description e-content"]/h3')
for i in CN[0:50]:
    CN=i.text
    Car_Name.append(CN)

In [549]:
Price=[]
PR=driver.find_elements(By.XPATH,'//div[@class="postBody description e-content"]/p/strong')
for i in PR:
    PR=i.text
    Price.append(PR)

In [551]:
df=pd.DataFrame({"Car Name":Car_Name,"Price":Price})
df

                              Car Name                        Price
0                  Aston Martin Valour          Price: $1.5 Million
1                         McLaren Elva          Price: $1.7 Million
2                          Czinger 21C          Price: $1.7 Million
3                        Ferrari Monza          Price: $1.7 Million
4                   Gordon Murray T.33          Price: $1.7 Million
5                    Koenigsegg Gemera          Price: $1.7 Million
6                          Zenvo TSR-S          Price: $1.7 Million
7                   Hennessey Venom F5          Price: $1.8 Million
8                      Bentley Bacalar          Price: $1.9 Million
9        Hispano Suiza Carmen Boulogne          Price: $1.9 Million
10              Bentley Mulliner Batur          Price: $2.0 Million
11                        Deus Vayanne          Price: $2.0 Million
12                         SSC Tuatara          Price: $2.0 Million
13                         Lotus Evija          Price: $2.1 Million
14                 Aston Martin Vulcan          Price: $2.3 Million
15                          Delage D12          Price: $2.3 Million
16                 Ferrari Daytona SP3          Price: $2.3 Million
17                   McLaren Speedtail          Price: $2.3 Million
18                        Rimac Nevera          Price: $2.4 Million
19                       Pagani Utopia          Price: $2.5 Million
20                Pininfarina Battista          Price: $2.5 Million
21                  Gordon Murray T.50          Price: $2.6 Million
22                Lamborghini Countach          Price: $2.6 Million
23            Mercedes-AMG Project One          Price: $2.7 Million
24                        Zenvo Aurora          Price: $2.8 Million
25                 Aston Martin Victor          Price: $3.0 Million
26         Hennessey Venom F5 Roadster                 $3.0 Million
27                    Koenigsegg Jesko          Price: $3.0 Million
28               Aston Martin Valkyrie          Price: $3.2 Million
29           W Motors Lykan Hypersport          Price: $3.4 Million
30                       McLaren Solus                 $3.5 Million
31                    Lamborghini Sian          Price: $3.6 million
32                    Koenigsegg CC850          Price: $3.7 Million
33     Bugatti Chiron Super Sport 300+          Price: $3.9 Million
34                  Lamborghini Veneno          Price: $4.5 Million
35                      Bugatti Bolide          Price: $4.7 Million
36           Pininfarina B95 Speedster          Price: $4.8 Million
37                     Bugatti Mistral          Price: $5.0 Million
38                 Pagani Huayra Imola          Price: $5.4 Million
39                        Bugatti Divo          Price: $5.8 Million
40                 SP Automotive Chaos          Price: $6.4 Million
41                    Pagani Codalunga          Price: $7.4 Million
42                        777 Hypercar          Price: $7.5 Million
43            Mercedes-Maybach Exelero          Price: $8.0 Million
44                  Bugatti Centodieci          Price: $9.0 Million
45             Bugatti Chiron Profilée         Price: $10.8 Million
46                Rolls-Royce Sweptail         Price: $12.8 Million
47            Bugatti La Voiture Noire         Price: $13.4 Million
48              Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)
49  Rolls-Royce La Rose Noire Droptail    Price: $30 Million (est.)